HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_bf.h
/** \brief Mask for Ifx_CIF_ISP_RIS_Bits.RIS_WD_TRIG */
#define IFX_CIF_ISP_RIS_RIS_WD_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_RIS_Bits.RIS_WD_TRIG */
#define IFX_CIF_ISP_RIS_RIS_WD_TRIG_OFF (19u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_ISP_OFF */
#define IFX_CIF_ISP_MIS_MIS_ISP_OFF_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_ISP_OFF */
#define IFX_CIF_ISP_MIS_MIS_ISP_OFF_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_ISP_OFF */
#define IFX_CIF_ISP_MIS_MIS_ISP_OFF_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME */
#define IFX_CIF_ISP_MIS_MIS_FRAME_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME */
#define IFX_CIF_ISP_MIS_MIS_FRAME_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME */
#define IFX_CIF_ISP_MIS_MIS_FRAME_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_DATA_LOSS */
#define IFX_CIF_ISP_MIS_MIS_DATA_LOSS_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_DATA_LOSS */
#define IFX_CIF_ISP_MIS_MIS_DATA_LOSS_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_DATA_LOSS */
#define IFX_CIF_ISP_MIS_MIS_DATA_LOSS_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_MIS_MIS_PIC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_MIS_MIS_PIC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_MIS_MIS_PIC_SIZE_ERR_OFF (3u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME_IN */
#define IFX_CIF_ISP_MIS_MIS_FRAME_IN_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME_IN */
#define IFX_CIF_ISP_MIS_MIS_FRAME_IN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_FRAME_IN */
#define IFX_CIF_ISP_MIS_MIS_FRAME_IN_OFF (5u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_V_START */
#define IFX_CIF_ISP_MIS_MIS_V_START_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_V_START */
#define IFX_CIF_ISP_MIS_MIS_V_START_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_V_START */
#define IFX_CIF_ISP_MIS_MIS_V_START_OFF (6u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_H_START */
#define IFX_CIF_ISP_MIS_MIS_H_START_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_H_START */
#define IFX_CIF_ISP_MIS_MIS_H_START_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_H_START */
#define IFX_CIF_ISP_MIS_MIS_H_START_OFF (7u)

/** \brief Length for Ifx_CIF_ISP_MIS_Bits.MIS_WD_TRIG */
#define IFX_CIF_ISP_MIS_MIS_WD_TRIG_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_MIS_Bits.MIS_WD_TRIG */
#define IFX_CIF_ISP_MIS_MIS_WD_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_MIS_Bits.MIS_WD_TRIG */
#define IFX_CIF_ISP_MIS_MIS_WD_TRIG_OFF (19u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_ISP_OFF */
#define IFX_CIF_ISP_ICR_ICR_ISP_OFF_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_ISP_OFF */
#define IFX_CIF_ISP_ICR_ICR_ISP_OFF_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_ISP_OFF */
#define IFX_CIF_ISP_ICR_ICR_ISP_OFF_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME */
#define IFX_CIF_ISP_ICR_ICR_FRAME_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME */
#define IFX_CIF_ISP_ICR_ICR_FRAME_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME */
#define IFX_CIF_ISP_ICR_ICR_FRAME_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_DATA_LOSS */
#define IFX_CIF_ISP_ICR_ICR_DATA_LOSS_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_DATA_LOSS */
#define IFX_CIF_ISP_ICR_ICR_DATA_LOSS_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_DATA_LOSS */
#define IFX_CIF_ISP_ICR_ICR_DATA_LOSS_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ICR_ICR_PIC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ICR_ICR_PIC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ICR_ICR_PIC_SIZE_ERR_OFF (3u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME_IN */
#define IFX_CIF_ISP_ICR_ICR_FRAME_IN_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME_IN */
#define IFX_CIF_ISP_ICR_ICR_FRAME_IN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME_IN */
#define IFX_CIF_ISP_ICR_ICR_FRAME_IN_OFF (5u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_V_START */
#define IFX_CIF_ISP_ICR_ICR_V_START_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_V_START */
#define IFX_CIF_ISP_ICR_ICR_V_START_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_V_START */
#define IFX_CIF_ISP_ICR_ICR_V_START_OFF (6u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_H_START */
#define IFX_CIF_ISP_ICR_ICR_H_START_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_H_START */
#define IFX_CIF_ISP_ICR_ICR_H_START_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_H_START */
#define IFX_CIF_ISP_ICR_ICR_H_START_OFF (7u)

/** \brief Length for Ifx_CIF_ISP_ICR_Bits.ICR_WD_TRIG */
#define IFX_CIF_ISP_ICR_ICR_WD_TRIG_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ICR_Bits.ICR_WD_TRIG */
#define IFX_CIF_ISP_ICR_ICR_WD_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ICR_Bits.ICR_WD_TRIG */
#define IFX_CIF_ISP_ICR_ICR_WD_TRIG_OFF (19u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_ISP_OFF */
#define IFX_CIF_ISP_ISR_ISR_ISP_OFF_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_ISP_OFF */
#define IFX_CIF_ISP_ISR_ISR_ISP_OFF_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_ISP_OFF */
#define IFX_CIF_ISP_ISR_ISR_ISP_OFF_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME */
#define IFX_CIF_ISP_ISR_ISR_FRAME_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME */
#define IFX_CIF_ISP_ISR_ISR_FRAME_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME */
#define IFX_CIF_ISP_ISR_ISR_FRAME_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_DATA_LOSS */
#define IFX_CIF_ISP_ISR_ISR_DATA_LOSS_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_DATA_LOSS */
#define IFX_CIF_ISP_ISR_ISR_DATA_LOSS_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_DATA_LOSS */
#define IFX_CIF_ISP_ISR_ISR_DATA_LOSS_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_ISR_Bits.ISR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ISR_ISR_PIC_SIZE_ERR_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ISR_Bits.ISR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ISR_ISR_PIC_SIZE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ISR_Bits.ISR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ISR_ISR_PIC_SIZE_ERR_OFF (3u)

