HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_OFF (2u)

/** \brief Length for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_OFF (4u)

/** \brief Length for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_LEN (30u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_MSK (0x3fffffffu)

/** \brief Offset for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.MP_CB_BASEAD_INIT */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_MP_CB_BASEAD_INIT_LEN (30u)

/** \brief Mask for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.MP_CB_BASEAD_INIT */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_MP_CB_BASEAD_INIT_MSK (0x3fffffffu)

/** \brief Offset for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.MP_CB_BASEAD_INIT */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_MP_CB_BASEAD_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_SIZE_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_SIZE_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_SIZE_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits.MP_CB_SIZE_INIT */
#define IFX_CIF_MI_MP_CB_SIZE_INIT_MP_CB_SIZE_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits.MP_CB_SIZE_INIT */
#define IFX_CIF_MI_MP_CB_SIZE_INIT_MP_CB_SIZE_INIT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_CB_SIZE_INIT_Bits.MP_CB_SIZE_INIT */
#define IFX_CIF_MI_MP_CB_SIZE_INIT_MP_CB_SIZE_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_OFFS_CNT_INIT_FIXED_TO_00_LEN (2u)

