HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_bf.h
/** \brief Mask for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_OFF (8u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_OFF (0u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_OFF (1u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_OFF (2u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_OFF (8u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_OFF (24u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_OFF (25u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_OFF (26u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_OFF (27u)

/** \brief Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_OFF (28u)

/** \brief Length for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_ENCODE_Bits.ENCODE */
#define IFX_CIF_JPE_ENCODE_ENCODE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_ENCODE_Bits.ENCODE */
#define IFX_CIF_JPE_ENCODE_ENCODE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_ENCODE_Bits.ENCODE */
#define IFX_CIF_JPE_ENCODE_ENCODE_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_ENCODE_Bits.CONT_MODE */
#define IFX_CIF_JPE_ENCODE_CONT_MODE_LEN (2u)

/** \brief Mask for Ifx_CIF_JPE_ENCODE_Bits.CONT_MODE */
#define IFX_CIF_JPE_ENCODE_CONT_MODE_MSK (0x3u)

/** \brief Offset for Ifx_CIF_JPE_ENCODE_Bits.CONT_MODE */
#define IFX_CIF_JPE_ENCODE_CONT_MODE_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_CBCR_SCALE_EN_Bits.CBCR_SCALE_EN */
#define IFX_CIF_JPE_CBCR_SCALE_EN_CBCR_SCALE_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_CBCR_SCALE_EN_Bits.CBCR_SCALE_EN */
#define IFX_CIF_JPE_CBCR_SCALE_EN_CBCR_SCALE_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_CBCR_SCALE_EN_Bits.CBCR_SCALE_EN */
#define IFX_CIF_JPE_CBCR_SCALE_EN_CBCR_SCALE_EN_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_TABLE_FLUSH_Bits.TABLE_FLUSH */
#define IFX_CIF_JPE_TABLE_FLUSH_TABLE_FLUSH_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_TABLE_FLUSH_Bits.TABLE_FLUSH */
#define IFX_CIF_JPE_TABLE_FLUSH_TABLE_FLUSH_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_TABLE_FLUSH_Bits.TABLE_FLUSH */
#define IFX_CIF_JPE_TABLE_FLUSH_TABLE_FLUSH_OFF (0u)

/** \brief Length for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_LEN (12u)

