HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_bf.h
/** \brief Length for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_OFF (13u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_OFF (14u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_OFF (15u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_OFF (16u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_OFF (17u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_OFF (18u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_OFF (19u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_OFF (20u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_OFF (21u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_OFF (22u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_OFF (23u)

/** \brief Length for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_LEN (32u)

/** \brief Mask for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_MSK (0xffffffffu)

/** \brief Offset for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_OFF (0u)

/** \brief Length for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_LEN (15u)

/** \brief Mask for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_MSK (0x7fffu)

/** \brief Offset for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_OFF (0u)

/** \brief Length for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_LEN (15u)

/** \brief Mask for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_MSK (0x7fffu)

/** \brief Offset for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_OFF (16u)

/** \brief Length for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_LEN (32u)

/** \brief Mask for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_MSK (0xffffffffu)

/** \brief Offset for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_OFF (0u)

/** \brief Length for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_LEN (30u)

/** \brief Mask for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_MSK (0x3fffffffu)

/** \brief Offset for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_OFF (0u)

/** \brief Length for Ifx_CIF_DP_UDS_1S_Bits.UDS */
#define IFX_CIF_DP_UDS_1S_UDS_LEN (15u)

/** \brief Mask for Ifx_CIF_DP_UDS_1S_Bits.UDS */
#define IFX_CIF_DP_UDS_1S_UDS_MSK (0x7fffu)

/** \brief Offset for Ifx_CIF_DP_UDS_1S_Bits.UDS */
#define IFX_CIF_DP_UDS_1S_UDS_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_1S_CTRL_IC_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_1S_CTRL_IC_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_EP_IC_1S_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_1S_CTRL_IC_EN_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_1S_RECENTER_RECENTER_LEN (3u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_1S_RECENTER_RECENTER_MSK (0x7u)

/** \brief Offset for Ifx_CIF_EP_IC_1S_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_1S_RECENTER_RECENTER_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_1S_H_OFFS_H_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_1S_H_OFFS_H_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_1S_H_OFFS_H_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_1S_V_OFFS_V_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_EP_IC_1S_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_1S_V_OFFS_V_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_EP_IC_1S_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_1S_V_OFFS_V_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_EP_IC_1S_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_1S_H_SIZE_H_SIZE_LEN (12u)

