HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_START_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_START_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_START_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_START_EP_OFFS_CNT_START_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_START_EP_OFFS_CNT_START_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_START_EP_OFFS_CNT_START_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_1S_CTRL_SHD_EP_ENABLE_IN_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_1S_CTRL_SHD_EP_ENABLE_IN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_1S_CTRL_SHD_EP_ENABLE_IN_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_1S_CTRL_SHD_EP_ENABLE_OUT_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_1S_CTRL_SHD_EP_ENABLE_OUT_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_1S_CTRL_SHD_EP_ENABLE_OUT_OFF (16u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_SHD_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_SHD_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_SHD_EP_BASE_AD_LEN (30u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_SHD_EP_BASE_AD_MSK (0x3fffffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_SHD_EP_BASE_AD_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_SIZE_SHD_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_SIZE_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_SIZE_SHD_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_1S_SIZE_SHD_EP_SIZE_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_1S_SIZE_SHD_EP_SIZE_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_1S_SIZE_SHD_EP_SIZE_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_SHD_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_SHD_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_SHD_EP_OFFS_CNT_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_SHD_EP_OFFS_CNT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_SHD_EP_OFFS_CNT_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_EP_IRQ_OFFS_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_EP_IRQ_OFFS_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_EP_IRQ_OFFS_OFF (2u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCIF_BF_H */
